# AssignedDuctLossMethod Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..AssignedDuctLossMethod Property
Connector Class See Also
---
The duct loss method of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DuctLossMethodType AssignedDuctLossMethod { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AssignedDuctLossMethod As DuctLossMethodType
	Get
```

Visual C++
---
```text
public:
property DuctLossMethodType AssignedDuctLossMethod {
	DuctLossMethodType get ();
}
```

# Remarks
Assigned duct loss method may be assigned for connectors of some family instances.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the connector's domain is not DomainHvac. Thrown when the connector is not in family instance. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown on failure to get duct loss method. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace